#Использовать asserts
#Использовать ".."

Перем УправлениеMSSQL Экспорт;
 
//*****************************************************************
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    ВсеТесты = Новый Массив; 
    ВсеТесты.Добавить("СоздатьБД");
	ВсеТесты.Добавить("ПолучитьСтруктуруФайловБД");
	ВсеТесты.Добавить("ИзменитьМодельВосстановленияБД_FULL");
	ВсеТесты.Добавить("СделатьРезервнуюКопиюБД_FULL");
	ВсеТесты.Добавить("СделатьРезервнуюКопиюБД_DIFFERENTIAL");
	ВсеТесты.Добавить("СделатьРезервнуюКопиюБД_LOG");
	ВсеТесты.Добавить("ВосстановитьБД");
	ВсеТесты.Добавить("ВосстановитьИзРезервнойКопииБД_И_УдалитьФайлНаСервере");
	ВсеТесты.Добавить("ИзменитьМодельВосстановленияБД_SIMPLE");
	ВсеТесты.Добавить("СжатьФайлыБД_LOG");
	ВсеТесты.Добавить("СжатьБД");
	ВсеТесты.Добавить("УдалитьБД");

    Возврат ВсеТесты;

КонецФункции
 
//*****************************************************************
Процедура ПередЗапускомТеста() Экспорт

	// Создадим объект	
	УправлениеMSSQL = Новый УправлениеMSSQL();

	// Введем параметры
	ПараметрыПодключения = УправлениеMSSQL.ПараметрыПодключения;
ПараметрыПодключения.АдресСервераSQL = "10.1.1.40";
	ПараметрыПодключения.ИмяПользователяSQL = "sa";
ПараметрыПодключения.ПарольПользователяSQL = "pass";
	ПараметрыПодключения.ИмяБазыДанныхSQL = "Test_OS_TMSSQL";

КонецПроцедуры
 
//*****************************************************************
Процедура ПослеЗапускаТеста() Экспорт

	// ПослеЗапускаТеста

КонецПроцедуры


//////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ ТЕСТИРОВАНИЯ ФУНКЦИОНАЛА

//*****************************************************************
Процедура СоздатьБД() Экспорт

	// Создадим базу данных
    Результат = УправлениеMSSQL.СоздатьБД();
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура ПолучитьСтруктуруФайловБД() Экспорт

	// Получим список файлов базы данных
	ТаблицаФайловБД = УправлениеMSSQL.ПолучитьСтруктуруФайловБД(); 
	Если ТаблицаФайловБД <> Неопределено Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура ИзменитьМодельВосстановленияБД_FULL() Экспорт

	// Сменим модель восстановления базы на полную
	Результат = УправлениеMSSQL.ИзменитьМодельВосстановленияБД("FULL");
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура СделатьРезервнуюКопиюБД_FULL() Экспорт

	// Сделаем полную резервную копию
	ПолноеИмяФайла = УправлениеMSSQL.СделатьРезервнуюКопиюБД(,,"FULL");
	Если ПолноеИмяФайла <> Неопределено Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	Приостановить(6000);	
	ДатаПолнойКопии = ТекущаяДата();
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура СделатьРезервнуюКопиюБД_DIFFERENTIAL() Экспорт

	// Сделаем разностную резервную копию
	ПолноеИмяФайла = УправлениеMSSQL.СделатьРезервнуюКопиюБД(,,"DIFFERENTIAL");
	Если ПолноеИмяФайла <> Неопределено Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	Приостановить(6000);	
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура СделатьРезервнуюКопиюБД_LOG() Экспорт

	// Сделем копию журнала транзакций
	ПолноеИмяФайла = УправлениеMSSQL.СделатьРезервнуюКопиюБД(,,"LOG");
	Если ПолноеИмяФайла <> Неопределено Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	Приостановить(6000);
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура ВосстановитьБД() Экспорт

	// Восстаноим базу на дату создания полной копии
	Результат = УправлениеMSSQL.ВосстановитьБД(ТекущаяДата());
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура ВосстановитьИзРезервнойКопииБД_И_УдалитьФайлНаСервере() Экспорт

	// Получим список файлов для восстановления на текущую дату
	МассивФайлов = УправлениеMSSQL.ПолучитьСписокФайловДляВосстановленияБД(); 
	Если МассивФайлов <> Неопределено Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
    Ожидаем.Что(Результат).Равно(Истина);

	// Восстановим базу данных по полученнуму ранее массиву файлов
	Результат = УправлениеMSSQL.ВосстановитьИзРезервнойКопииБД(МассивФайлов);
	Ожидаем.Что(Результат).Равно(Истина);
	
	// Удалим файлы резервных копий
	Если МассивФайлов <> Неопределено Тогда
		Для Сч = 0 По МассивФайлов.Количество()-1 Цикл
			ИмяФайлаДляУдаления = МассивФайлов.Получить(Сч);
			Результат = УправлениеMSSQL.УдалитьФайлНаСервере(ИмяФайлаДляУдаления);
			Ожидаем.Что(Результат).Равно(Истина);
		КонецЦикла;
	Иначе
		Результат = Ложь;
		Ожидаем.Что(Результат).Равно(Истина);
	КонецЕсли;

КонецПроцедуры

//*****************************************************************
Процедура ИзменитьМодельВосстановленияБД_SIMPLE() Экспорт

	Результат = УправлениеMSSQL.ИзменитьМодельВосстановленияБД("SIMPLE");
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура СжатьФайлыБД_LOG() Экспорт

	Результат = УправлениеMSSQL.СжатьФайлыБД("LOG");
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура СжатьБД() Экспорт

	Результат = УправлениеMSSQL.СжатьБД();
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

//*****************************************************************
Процедура УдалитьБД() Экспорт

	Результат = УправлениеMSSQL.УдалитьБД();
    Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры


